recreated the specs
